#include <iostream>

#include "data_structure.hpp"


using namespace std;
using namespace itis;


int main() {

  /*
   * Поздравляю, мой юный, мы смотрим разные фильмы, друг. Сейчас мы с тобой попробуем создать дерево.
   * Красно-черное дерево. Для того чтобы это сделать возьми вот это: RBtree tree =  RBtree();, скопируй(Ctrl+C)
   * и вставь в ту часть кода, которая находится ЗА пределом подсказки(перед return 0;). Я верю в тебя...
   * Теперь у тебя есть несколько опций:
   * 1) Вставить значение: tree.Insert(то число, которое ты хочешь вставить);
   * 2) Удалить значение: tree.Remove(то число, которое ты хочешь выбросить со скалы, как непригодное);
   * 3) Найти значение: tree.Find(то число, которое, ну не знаю, что-то украло у тебя, разбирайся с нам сам);
   * 4) Показать тебе то, что ты создал: tree.Show().
   * Сейчас тебе нужно запустить эту адскую машину. Сверху, слева, там есть вот это: (int main() {),
   * рядом зеленая стрелочка, нажни на неё, потом увидишь Run'main' написано будет, кликай. Либо же Ctrl+Shift+F10.
   * Mission completed!
  */


  return 0;
}